#ifndef __OS_PM_H__
#define __OS_PM_H__
#include "os_cpu_def.h"
typedef struct cluster_info
{
	uint32 id;
	uint32 num;
} cluster_info;

/*********************************************************************************************************************
* 簇分配函数，和cluster_free联合使用
* num：要分配多少个page
* return：分配到的簇的信息
*********************************************************************************************************************/
cluster_info cluster_alloc(int num);
/*********************************************************************************************************************
* 簇释放函数，和cluster_alloc联合使用
* page_id：要释放的簇第一pageid
*********************************************************************************************************************/
void cluster_free(uint32 page_id);
#endif